IndianPudding.org
I tried to make an Indian Pudding with my slow cooker by combining two recipes that I found online.
- [[http://cooking.nytimes.com/recipes/1016896-indian-pudding][Indian Pudding from the NY Times]]
- [[http://www.simplyrecipes.com/recipes/indian_pudding/][Simply Recipes.com]]
* Ingredients
- 4 c. Milk
- 1 c. corn meal
- 1/2 c. molasses
- 4 eggs
- 1/2 c. brown sugar
- 1 tsp. nutmeg
- 1/2 tsp. cinnamon
- 1/2 tsp. ginger
- 1/2 c. water

* Instructions
Heat milk so that it is hot, but not boiling.  Then whisk in the cornmeal and molasses and cook 2 minutes.  Reduce the heat.

Beat the eggs and mix in 1/2 c. of the hot cornmeal mixture.  Pour the egg mixture into the pan and whisk it constantly.  Cook it for 3 minutes.

Stir in the spices and pour into the slow cooker dish.  Pour in the water and mix it thoroughly.  Then set the slow cooker on low and let it simmer.
